Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظاما فكسونا العظام لحما ثم أنشأناه خلقا آخر فتبارك الله أحسن الخالقين
en: Then fashioned We the drop a clot, then fashioned We the clot a little lump, then fashioned We the little lump bones, then clothed the bones with flesh, and then produced it as another creation. So blessed be Allah, the Best of creators!

source: ثم إنكم بعد ذلك لميتون
en: Then lo! after that ye surely die.

source: ثم إنكم يوم القيامة تبعثون
en: Then lo! on the Day of Resurrection ye are raised (again).

source: ولقد خلقنا فوقكم سبع طرائق وما كنا عن الخلق غافلين
en: And We have created above you seven paths, and We are never unmindful of creation.

source: وأنزلنا من السماء ماء بقدر فأسكناه في الأرض وإنا على ذهاب به لقادرون
en: And we send down from the sky water in measure, and We give it lodging in the earth, and lo! We are Able to withdraw it.

source: فأنشأنا لكم به جنات من نخيل وأعناب لكم فيها فواكه كثيرة ومنها تأكلون
en: Then We produce for you therewith gardens of date-palms and grapes, wherein is much fruit for you and whereof ye eat;

source: وشجرة تخرج من طور سيناء تنبت بالدهن وصبغ للآكلين
en: And a tree that springeth forth from Mount Sinai that groweth oil and relish for the eaters.

source: وإن لكم في الأنعام لعبرة نسقيكم مما في بطونها ولكم فيها منافع كثيرة ومنها تأكلون
en: And lo! in the cattle there is verily a lesson for you. We give you to drink of that which is in their bellies, and many uses have ye in them, and of them do ye eat;

source: وعليها وعلى الفلك تحملون
en: And on them and on the ship ye are carried.

source: ولقد أرسلنا نوحا إلى قومه فقال يا قوم اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And We verily sent Noah unto his folk, and he said: O my people! Serve Allah. Ye have no other Allah save Him. Will ye not ward off (evil)?

source: فقال الملأ الذين كفروا من قومه ما هذا إلا بشر مثلكم يريد أن يتفضل عليكم ولو شاء الله لأنزل ملائكة ما سمعنا بهذا في آبائنا الأولين
en: But the chieftains of his folk, who disbelieved, said: This is only a mortal like you who would make himself superior to you. Had Allah willed, He surely could have sent down angels. We heard not of this in the case of our fathers of old.

source: إن هو إلا رجل به جنة فتربصوا به حتى حين
en: He is only a man in whom is a madness, so watch him for a while.

source: قال رب انصرني بما كذبون
en: He said: My Lord! Help me because they deny me.

source: فأوحينا إليه أن اصنع الفلك بأعيننا ووحينا فإذا جاء أمرنا وفار التنور فاسلك فيها من كل زوجين اثنين وأهلك إلا من سبق عليه القول منهم ولا تخاطبني في الذين ظلموا إنهم مغرقون
en: Then We inspired in him, saying: Make the ship under Our eyes and Our inspiration. Then, when Our command cometh and the oven gusheth water, introduce therein of every (kind) two spouses, and thy household save him thereof against whom the Word hath already gone forth. And plead not with Me on behalf of those who have done wrong. Lo! they will be drowned.

source: فإذا استويت أنت ومن معك على الفلك فقل الحمد لله الذي نجانا من القوم الظالمين
en: And when thou art on board the ship, thou and whoso is with thee, then say: Praise be to Allah Who hath saved us from the wrongdoing folk!

source: وقل رب أنزلني منزلا مباركا وأنت خير المنزلين
en: And say: My Lord! Cause me to land at a blessed landing-place, for Thou art Best of all who bring to land.

source: إن في ذلك لآيات وإن كنا لمبتلين
en: Lo! herein verily are portents, for lo! We are ever putting (mankind) to the test.

source: ثم أنشأنا من بعدهم قرنا آخرين
en: Then, after them, We brought forth another generation;

source: فأرسلنا فيهم رسولا منهم أن اعبدوا الله ما لكم من إله غيره أفلا تتقون
en: And we sent among them a messenger of their own, saying: Serve Allah, Ye have no other Allah save Him. Will ye not ward off (evil)?

source: وقال الملأ من قومه الذين كفروا وكذبوا بلقاء الآخرة وأترفناهم في الحياة الدنيا ما هذا إلا بشر مثلكم يأكل مما تأكلون منه ويشرب مما تشربون
en: And the chieftains of his folk, who disbelieved and denied the meeting of the Hereafter, and whom We had made soft in the life of the world, said: This is only a mortal like you, who eateth of that whereof ye eat and drinketh of that ye drink.

source: ولئن أطعتم بشرا مثلكم إنكم إذا لخاسرون
en: If ye were to obey a mortal like yourselves, then, lo! ye surely would be losers.

source: أيعدكم أنكم إذا متم وكنتم ترابا وعظاما أنكم مخرجون
en: Doth he promise you that you, when ye are dead and have become dust and bones, will (again) be brought forth?

source: هيهات هيهات لما توعدون
en: Begone, begone, with that which ye are promised!

source: إن هي إلا حياتنا الدنيا نموت ونحيا وما نحن بمبعوثين
en: There is naught but our life of the world; we die and we live, and we shall not be raised (again).

source: إن هو إلا رجل افترى على الله كذبا وما نحن له بمؤمنين
en: He is only a man who hath invented a lie about Allah. We are not going to put faith in him.

source: قال عما قليل ليصبحن نادمين
en: He said: In a little while they surely will become repentant.

source: فأخذتهم الصيحة بالحق فجعلناهم غثاء فبعدا للقوم الظالمين
en: So the (Awful) Cry overtook them rightfully, and We made them like as wreckage (that a torrent hurleth). A far removal for wrongdoing folk!

source: ثم أنشأنا من بعدهم قرونا آخرين
en: Then after them We brought forth other generations.

source: ثم أرسلنا رسلنا تترى كل ما جاء أمة رسولها كذبوه فأتبعنا بعضهم بعضا وجعلناهم أحاديث فبعدا لقوم لا يؤمنون
en: Then We sent our messengers one after another. Whenever its messenger came unto a nation they denied him; so We caused them to follow one another (to disaster) and We made them bywords. A far removal for folk who believe not!

source: ثم أرسلنا موسى وأخاه هارون بآياتنا وسلطان مبين
en: Then We sent Moses and his brother Aaron with Our tokens and a clear warrant

source: إلى فرعون وملئه فاستكبروا وكانوا قوما عالين
en: Unto Pharaoh and his chiefs, but they scorned (them) and they were despotic folk.

source: فقالوا أنؤمن لبشرين مثلنا وقومهما لنا عابدون
en: And they said: Shall we put faith in two mortals like ourselves, and whose folk are servile unto us?

source: فكذبوهما فكانوا من المهلكين
en: So they denied them, and became of those who were destroyed.

source: ولقد آتينا موسى الكتاب لعلهم يهتدون
en: And We verily gave Moses the Scripture, that haply they might go aright.

source: وجعلنا ابن مريم وأمه آية وآويناهما إلى ربوة ذات قرار ومعين
en: And We made the son of Mary and his mother a portent, and We gave them refuge on a height, a place of flocks and watersprings.

source: يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم
en: O ye messengers! Eat of the good things, and do right. Lo! I am Aware of what ye do.

source: وإن هذه أمتكم أمة واحدة وأنا ربكم فاتقون
en: And lo! this your religion is one religion and I am your Lord, so keep your duty unto Me.

source: فتقطعوا أمرهم بينهم زبرا كل حزب بما لديهم فرحون
en: But they (mankind) have broken their religion among them into sects, each group rejoicing in its tenets.

source: فذرهم في غمرتهم حتى حين
en: So leave them in their error till a time.

source: أيحسبون أنما نمدهم به من مال وبنين
en: Think they that in the wealth and sons wherewith We provide them

source: نسارع لهم في الخيرات بل لا يشعرون
en: We hasten unto them with good things? Nay, but they perceive not.

source: إن الذين هم من خشية ربهم مشفقون
en: Lo! those who go in awe for fear of their Lord.

source: والذين هم بآيات ربهم يؤمنون
en: And those who believe in the revelations of their Lord,

source: والذين هم بربهم لا يشركون
en: And those who ascribe not partners unto their Lord,

source: والذين يؤتون ما آتوا وقلوبهم وجلة أنهم إلى ربهم راجعون
en: And those who give that which they give with hearts afraid because they are about to return unto their Lord,

source: أولئك يسارعون في الخيرات وهم لها سابقون
en: These race for the good things, and they shall win them in the race.

source: ولا نكلف نفسا إلا وسعها ولدينا كتاب ينطق بالحق وهم لا يظلمون
en: And we task not any soul beyond its scope, and with Us is a Record which speaketh the truth, and they will not be wronged.

source: بل قلوبهم في غمرة من هذا ولهم أعمال من دون ذلك هم لها عاملون
en: Nay, but their hearts are in ignorance of this (Qur'an), and they have other works, besides, which they are doing;

source: حتى إذا أخذنا مترفيهم بالعذاب إذا هم يجأرون
en: Till when We grasp their luxurious ones with the punishment, behold! they supplicate.

source: لا تجأروا اليوم إنكم منا لا تنصرون
en: Supplicate not this day! Assuredly ye will not be helped by Us.

source: قد كانت آياتي تتلى عليكم فكنتم على أعقابكم تنكصون
en: My revelations were recited unto you, but ye used to turn back on your heels,

source: مستكبرين به سامرا تهجرون
en: In scorn thereof. Nightly did ye rave together.

source: أفلم يدبروا القول أم جاءهم ما لم يأت آباءهم الأولين
en: Have they not pondered the Word, or hath that come unto them which came not unto their fathers of old?

source: أم لم يعرفوا رسولهم فهم له منكرون
en: Or know they not their messenger, and so reject him?

source: أم يقولون به جنة بل جاءهم بالحق وأكثرهم للحق كارهون
en: Or say they: There is a madness in him? Nay, but he bringeth them the Truth; and most of them are haters of the Truth.

source: ولو اتبع الحق أهواءهم لفسدت السماوات والأرض ومن فيهن بل أتيناهم بذكرهم فهم عن ذكرهم معرضون
en: And if the Truth had followed their desires, verily the heavens and the earth and whosoever is therein had been corrupted. Nay, We have brought them their Reminder, but from their Reminder they now turn away.

source: أم تسألهم خرجا فخراج ربك خير وهو خير الرازقين
en: Or dost thou ask of them (O Muhammad) any tribute? But the bounty of thy Lord is better, for He is Best of all who make provision.

source: وإنك لتدعوهم إلى صراط مستقيم
en: And lo! thou summonest them indeed unto a straight path.

source: وإن الذين لا يؤمنون بالآخرة عن الصراط لناكبون
en: And lo! those who believe not in the Hereafter are indeed astray from the path.

source: ولو رحمناهم وكشفنا ما بهم من ضر للجوا في طغيانهم يعمهون
en: Though We had mercy on them and relieved them of the harm afflicting them, they still would wander blindly on in their contumacy.

source: ولقد أخذناهم بالعذاب فما استكانوا لربهم وما يتضرعون
en: Already have We grasped them with punishment, but they humble not themselves unto their Lord, nor do they pray,

source: حتى إذا فتحنا عليهم بابا ذا عذاب شديد إذا هم فيه مبلسون
en: Until, when We open for them the gate of extreme punishment, behold! they are aghast thereat.

source: وهو الذي أنشأ لكم السمع والأبصار والأفئدة قليلا ما تشكرون
en: He it is Who hath created for you ears and eyes and hearts. Small thanks give ye!

source: وهو الذي ذرأكم في الأرض وإليه تحشرون
en: And He it is Who hath sown you broadcast in the earth, and unto Him ye will be gathered.

source: وهو الذي يحيي ويميت وله اختلاف الليل والنهار أفلا تعقلون
en: And He it is Who giveth life and causeth death, and His is the difference of night and day. Have ye then no sense?

source: بل قالوا مثل ما قال الأولون
en: Nay, but they say the like of that which said the men of old;

source: قالوا أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: They say: When we are dead and have become (mere) dust and bones, shall we then, forsooth, be raised again?

source: لقد وعدنا نحن وآباؤنا هذا من قبل إن هذا إلا أساطير الأولين
en: We were already promised this, we and our forefathers. Lo! this is naught but fables of the men of old.

source: قل لمن الأرض ومن فيها إن كنتم تعلمون
en: Say: Unto Whom (belongeth) the earth and whosoever is therein, if ye have knowledge?

source: سيقولون لله قل أفلا تذكرون
en: They will say: Unto Allah. Say: Will ye not then remember?

source: قل من رب السماوات السبع ورب العرش العظيم
en: Say: Who is Lord of the seven heavens, and Lord of the Tremendous Throne?

source: سيقولون لله قل أفلا تتقون
en: They will say: Unto Allah (all that belongeth). Say: Will ye not then keep duty (unto Him)?

source: قل من بيده ملكوت كل شيء وهو يجير ولا يجار عليه إن كنتم تعلمون
en: Say: In Whose hand is the dominion over all things and He protecteth, while against Him there is no protection, if ye have knowledge?

source: سيقولون لله قل فأنى تسحرون
en: They will say: Unto Allah (all that belongeth). Say: How then are ye bewitched?

source: بل أتيناهم بالحق وإنهم لكاذبون
en: Nay, but We have brought them the Truth, and lo! they are liars.

source: ما اتخذ الله من ولد وما كان معه من إله إذا لذهب كل إله بما خلق ولعلا بعضهم على بعض سبحان الله عما يصفون
en: Allah hath not chosen any son, nor is there any god along with Him; else would each god have assuredly championed that which he created, and some of them would assuredly have overcome others. Glorified be Allah above all that they allege.

source: عالم الغيب والشهادة فتعالى عما يشركون
en: Knower of the Invisible and the Visible! and Exalted be He over all that they ascribe as partners (unto Him)!

source: قل رب إما تريني ما يوعدون
en: Say: My Lord! If Thou shouldst show me that which they are promised.

source: رب فلا تجعلني في القوم الظالمين
en: My Lord! then set me not among the wrongdoing folk.

source: وإنا على أن نريك ما نعدهم لقادرون
en: And verily We are Able to show thee that which We have promised them.

source: ادفع بالتي هي أحسن السيئة نحن أعلم بما يصفون
en: Repel evil with that which is better. We are Best Aware of that which they allege.

source: وقل رب أعوذ بك من همزات الشياطين
en: And say: My Lord! I seek refuge in Thee from suggestions of the evil ones,

source: وأعوذ بك رب أن يحضرون
en: And I seek refuge in Thee, my Lord, lest they be present with me,

source: حتى إذا جاء أحدهم الموت قال رب ارجعون
en: Until, when death cometh unto one of them, he saith: My Lord! Send me back,

source: لعلي أعمل صالحا فيما تركت كلا إنها كلمة هو قائلها ومن ورائهم برزخ إلى يوم يبعثون
en: That I may do right in that which I have left behind! But nay! It is but a word that he speaketh; and behind them is a barrier until the day when they are raised.

source: فإذا نفخ في الصور فلا أنساب بينهم يومئذ ولا يتساءلون
en: And when the trumpet is blown there will be no kinship among them that day, nor will they ask of one another.

source: فمن ثقلت موازينه فأولئك هم المفلحون
en: Then those whose scales are heavy, they are the successful.

source: ومن خفت موازينه فأولئك الذين خسروا أنفسهم في جهنم خالدون
en: And those whose scales are light are those who lose their souls, in hell abiding.

source: تلفح وجوههم النار وهم فيها كالحون
en: The fire burneth their faces, and they are glum therein.

source: ألم تكن آياتي تتلى عليكم فكنتم بها تكذبون
en: (It will be said): Were not My revelations recited unto you, and then ye used to deny them?

source: قالوا ربنا غلبت علينا شقوتنا وكنا قوما ضالين
en: They will say: Our Lord! Our evil fortune conquered us, and we were erring folk.

source: ربنا أخرجنا منها فإن عدنا فإنا ظالمون
en: Our Lord! Oh, bring us forth from hence! If we return (to evil) then indeed we shall be wrong-doers.

source: قال اخسئوا فيها ولا تكلمون
en: He saith: Begone therein, and speak not unto Me.

source: إنه كان فريق من عبادي يقولون ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين
en: Lo! there was a party of My slaves who said: Our Lord! We believe, therefor forgive us and have mercy on us for Thou art Best of all who show mercy;

source: فاتخذتموهم سخريا حتى أنسوكم ذكري وكنتم منهم تضحكون
en: But ye chose them for a laughing-stock until they caused you to forget remembrance of Me, while ye laughed at them.

source: إني جزيتهم اليوم بما صبروا أنهم هم الفائزون
en: Lo! I have rewarded them this day forasmuch as they were steadfast in that they, even they, are the triumphant.

source: قال كم لبثتم في الأرض عدد سنين
en: He will say: How long tarried ye in the earth, counting by years?

source: قالوا لبثنا يوما أو بعض يوم فاسأل العادين
en: They will say: We tarried by a day or part of a day. Ask of those who keep count!

source: قال إن لبثتم إلا قليلا لو أنكم كنتم تعلمون
en: He will say: Ye tarried but a little if ye only knew.

source: أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون
en: Deemed ye then that We had created you for naught, and that ye would not be returned unto Us?

source: فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم
en: Now Allah be Exalted, the True King! There is no Allah save Him, the Lord of the Throne of Grace.

source: ومن يدع مع الله إلها آخر لا برهان له به فإنما حسابه عند ربه إنه لا يفلح الكافرون
en: He who crieth unto any other god along with Allah hath no proof thereof. His reckoning is only with his Lord. Lo! disbelievers will not be successful.

source: وقل رب اغفر وارحم وأنت خير الراحمين
en: And (O Muhammad) say: My Lord! Forgive and have mercy, for Thou art Best of all who show mercy.

source: سورة أنزلناها وفرضناها وأنزلنا فيها آيات بينات لعلكم تذكرون
en: (Here is) a surah which We have revealed and enjoined, and wherein We have revealed plain tokens, that haply ye may take heed.

source: الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة ولا تأخذكم بهما رأفة في دين الله إن كنتم تؤمنون بالله واليوم الآخر وليشهد عذابهما طائفة من المؤمنين
en: The adulterer and the adulteress, scourge ye each one of them (with) a hundred stripes. And let not pity for the twain withhold you from obedience to Allah, if ye believe in Allah and the Last Day. And let a party of believers witness their punishment.

source: الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين
en: The adulterer shall not marry save an adulteress or an idolatress, and the adulteress none shall marry save an adulterer or an idolater. All that is forbidden unto believers.

source: والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء فاجلدوهم ثمانين جلدة ولا تقبلوا لهم شهادة أبدا وأولئك هم الفاسقون
en: And those who accuse honourable women but bring not four witnesses, scourge them (with) eighty stripes and never (afterward) accept their testimony - They indeed are evil-doers -

source: والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم فشهادة أحدهم أربع شهادات بالله إنه لمن الصادقين
en: As for those who accuse their wives but have no witnesses except themselves; let the testimony of one of them be four testimonies, (swearing) by Allah that he is of those who speak the truth;

source: والخامسة أن لعنت الله عليه إن كان من الكاذبين
en: And yet a fifth, invoking the curse of Allah on him if he is of those who lie.

source: ويدرأ عنها العذاب أن تشهد أربع شهادات بالله إنه لمن الكاذبين
en: And it shall avert the punishment from her if she bear witness before Allah four times that the thing he saith is indeed false,

source: والخامسة أن غضب الله عليها إن كان من الصادقين
en: And a fifth (time) that the wrath of Allah be upon her if he speaketh truth.

source: ولولا فضل الله عليكم ورحمته وأن الله تواب حكيم
en: And had it not been for the grace of Allah and His mercy unto you, and that Allah is Clement, Wise, (ye had been undone).

source: إن الذين جاءوا بالإفك عصبة منكم لا تحسبوه شرا لكم بل هو خير لكم لكل امرئ منهم ما اكتسب من الإثم والذي تولى كبره منهم له عذاب عظيم
en: Lo! they who spread the slander are a gang among you. Deem it not a bad thing for you; nay, it is good for you. Unto every man of them (will be paid) that which he hath earned of the sin; and as for him among them who had the greater share therein, his will be an awful doom.

source: لولا إذ سمعتموه ظن المؤمنون والمؤمنات بأنفسهم خيرا وقالوا هذا إفك مبين
en: Why did not the believers, men and women, when ye heard it, think good of their own own folk, and say: It is a manifest untruth?

source: لولا جاءوا عليه بأربعة شهداء فإذ لم يأتوا بالشهداء فأولئك عند الله هم الكاذبون
en: Why did they not produce four witnesses? Since they produce not witnesses, they verily are liars in the sight of Allah.

source: ولولا فضل الله عليكم ورحمته في الدنيا والآخرة لمسكم في ما أفضتم فيه عذاب عظيم
en: Had it not been for the grace of Allah and His mercy unto you in the world and the Hereafter an awful doom had overtaken you for that whereof ye murmured.

source: إذ تلقونه بألسنتكم وتقولون بأفواهكم ما ليس لكم به علم وتحسبونه هينا وهو عند الله عظيم
en: When ye welcomed it with your tongues, and uttered with your mouths that whereof ye had no knowledge, ye counted it a trifle. In the sight of Allah it is very great.

source: ولولا إذ سمعتموه قلتم ما يكون لنا أن نتكلم بهذا سبحانك هذا بهتان عظيم
en: Wherefor, when ye heard it, said ye not: It is not for us to speak of this. Glory be to Thee (O Allah)! This is awful calumny.

source: يعظكم الله أن تعودوا لمثله أبدا إن كنتم مؤمنين
en: Allah admonisheth you that ye repeat not the like thereof ever, if ye are (in truth) believers.

source: ويبين الله لكم الآيات والله عليم حكيم
en: And He expoundeth unto you the revelations. Allah is Knower, Wise.

source: إن الذين يحبون أن تشيع الفاحشة في الذين آمنوا لهم عذاب أليم في الدنيا والآخرة والله يعلم وأنتم لا تعلمون
en: Lo! those who love that slander should be spread concerning those who believe, theirs will be a painful punishment in the world and the Hereafter. Allah knoweth. Ye know not.

source: ولولا فضل الله عليكم ورحمته وأن الله رءوف رحيم
en: Had it not been for the grace of Allah and His mercy unto you, and that Allah is Clement, Merciful, (ye had been undone).

source: يا أيها الذين آمنوا لا تتبعوا خطوات الشيطان ومن يتبع خطوات الشيطان فإنه يأمر بالفحشاء والمنكر ولولا فضل الله عليكم ورحمته ما زكى منكم من أحد أبدا ولكن الله يزكي من يشاء والله سميع عليم
en: O ye who believe! Follow not the footsteps of the devil. Unto whomsoever followeth the footsteps of the devil, lo! he commandeth filthiness and wrong. Had it not been for the grace of Allah and His mercy unto you, not one of you would ever have grown pure. But Allah causeth whom He will to grow. And Allah is Hearer, Knower.

source: ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى والمساكين والمهاجرين في سبيل الله وليعفوا وليصفحوا ألا تحبون أن يغفر الله لكم والله غفور رحيم
en: And let not those who possess dignity and ease among you swear not to give to the near of kin and to the needy, and to fugitives for the cause of Allah. Let them forgive and show indulgence. Yearn ye not that Allah may forgive you? Allah is Forgiving, Merciful.

source: إن الذين يرمون المحصنات الغافلات المؤمنات لعنوا في الدنيا والآخرة ولهم عذاب عظيم
en: Lo! as for those who traduce virtuous, believing women (who are) careless, cursed are they in the world and the Hereafter. Theirs will be an awful doom

source: يوم تشهد عليهم ألسنتهم وأيديهم وأرجلهم بما كانوا يعملون
en: On the day when their tongues and their hands and their feet testify against them as to what they used to do,

source: يومئذ يوفيهم الله دينهم الحق ويعلمون أن الله هو الحق المبين
en: On that day Allah will pay them their just due, and they will know that Allah, He is the Manifest Truth.

source: الخبيثات للخبيثين والخبيثون للخبيثات والطيبات للطيبين والطيبون للطيبات أولئك مبرءون مما يقولون لهم مغفرة ورزق كريم
en: Vile women are for vile men, and vile men for vile women. Good women are for good men, and good men for good women; such are innocent of that which people say: For them is pardon and a bountiful provision.

source: يا أيها الذين آمنوا لا تدخلوا بيوتا غير بيوتكم حتى تستأنسوا وتسلموا على أهلها ذلكم خير لكم لعلكم تذكرون
en: O ye who believe! Enter not houses other than your own without first announcing your presence and invoking peace upon the folk thereof. That is better for you, that ye may be heedful.

source: فإن لم تجدوا فيها أحدا فلا تدخلوها حتى يؤذن لكم وإن قيل لكم ارجعوا فارجعوا هو أزكى لكم والله بما تعملون عليم
en: And if ye find no-one therein, still enter not until permission hath been given. And if it be said unto you: Go away again, then go away, for it is purer for you. Allah knoweth what ye do.

source: ليس عليكم جناح أن تدخلوا بيوتا غير مسكونة فيها متاع لكم والله يعلم ما تبدون وما تكتمون
en: (It is) no sin for you to enter uninhabited houses wherein is comfort for you. Allah knoweth what ye proclaim and what ye hide.
